src/META-INF/wsdl/ProvisioningEndpointSlsb.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3.2-hudson-754-SNAPSHOT. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3.2-hudson-754-SNAPSHOT. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://provisioning.iap.iptv.ericsson.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://provisioning.iap.iptv.ericsson.com/" name="ProvisioningEndpointSlsbService">
<import namespace="http://schemas.ericsson.com/cai3g1.2/" location="ProvisioningEndpointSlsb.wsdl_1.wsdl"></import>
<binding xmlns:ns1="http://schemas.ericsson.com/cai3g1.2/" name="ProvisioningEndpointSlsbPortBinding" type="ns1:Provisioning">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
<operation name="Get">
<soap:operation soapAction="CAI3G#Get" style="document"></soap:operation>
<input>
<soap:body use="literal"></soap:body>
<soap:header message="ns1:HeadInfo" part="sessionId" use="literal"></soap:header>
<soap:header message="ns1:HeadInfo" part="transactionId" use="literal"></soap:header>
<soap:header message="ns1:HeadInfo" part="sequenceId" use="literal"></soap:header>
</input>
<output>
<soap:body use="literal"></soap:body>
<soap:header message="ns1:HeadInfo" part="sessionId" use="literal">
<soap:headerfault message="ns1:Cai3gHeaderFault" part="ns1:SessionIdFault"></soap:headerfault>
</soap:header>
<soap:header message="ns1:HeadInfo" part="transactionId" use="literal">
<soap:headerfault message="ns1:Cai3gHeaderFault" part="ns1:TransactionIdFault"></soap:headerfault>
</soap:header>
<soap:header message="ns1:HeadInfo" part="sequenceId" use="literal">
<soap:headerfault message="ns1:Cai3gHeaderFault" part="ns1:SequenceIdFault"></soap:headerfault>
</soap:header>
</output>
<fault name="Cai3GFault_Exception">
<soap:fault name="Cai3GFault_Exception" use="literal"></soap:fault>
</fault>
</operation>
<operation name="Set">
<soap:operation soapAction="CAI3G#Set"></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
<fault name="Cai3GFault_Exception">
<soap:fault name="Cai3GFault_Exception" use="literal"></soap:fault>
</fault>
</operation>
<operation name="Delete">
<soap:operation soapAction="CAI3G#Delete"></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
<fault name="Cai3GFault_Exception">
<soap:fault name="Cai3GFault_Exception" use="literal"></soap:fault>
</fault>
</operation>
<operation name="Search">
<soap:operation soapAction="CAI3G#Search"></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
<fault name="Cai3GFault_Exception">
<soap:fault name="Cai3GFault_Exception" use="literal"></soap:fault>
</fault>
</operation>
<operation name="Create">
<soap:operation soapAction="CAI3G#Create"></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
<fault name="Cai3GFault_Exception">
<soap:fault name="Cai3GFault_Exception" use="literal"></soap:fault>
</fault>
</operation>
</binding>
<service name="ProvisioningEndpointSlsbService">
<port name="ProvisioningEndpointSlsbPort" binding="tns:ProvisioningEndpointSlsbPortBinding">
<soap:address location="http://127.0.0.1:38080/provisioning/ProvisioningEndpointSlsb"></soap:address>
</port>
</service>
</definitions>