IMSAssociation/IMSAssociationGETPubId.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns:hss="http://schemas.ericsson.com/ma/HSS/">
   <soapenv:Header>
     <cai3:SessionId>${SessionId}</cai3:SessionId>
   </soapenv:Header>
   <soapenv:Body>
      <cai3:Get>
         <cai3:MOType>IMSAssociation@http://schemas.ericsson.com/ma/HSS/</cai3:MOType>
         <cai3:MOId>
            <hss:impu>${publicIdValue}</hss:impu>
         </cai3:MOId>
      </cai3:Get>
   </soapenv:Body>
</soapenv:Envelope>