test/user_create_req.xml

<?xml version="1.0"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/"><S:Header><cai3:SessionId>963983366d244eab80232b589be72e39</cai3:SessionId></S:Header><S:Body><cai3:Create xmlns:hss="http://schemas.ericsson.com/ma/HSS/"><cai3:MOType>IMSAssociation@http://schemas.ericsson.com/ma/HSS/</cai3:MOType><cai3:MOId><hss:associationId>test@test.com</hss:associationId></cai3:MOId><cai3:MOAttributes><hss:CreateIMSAssociation associationId="test@test.com"><hss:associationId>test@test.com</hss:associationId></hss:CreateIMSAssociation></cai3:MOAttributes></cai3:Create></S:Body></S:Envelope>