tests/ivica_vobb_test.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns="http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/">
   <soapenv:Header>
      <cai3:SessionId>{0}</cai3:SessionId>
   </soapenv:Header>
   <soapenv:Body>
      <cai3:Set>
         <cai3:MOType>IMSSubscription@http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/</cai3:MOType>
         <cai3:MOId>
            <subscriberId>+353766840001@voice.eir.ie</subscriberId>
         </cai3:MOId>
         <cai3:MOAttributes>
            <setIMSSubscription subscriberId="+353766840001@voice.eir.ie" xmlns="http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/">
               <subscriberId>+353766840001@voice.eir.ie</subscriberId>
               <privateUser privateUserId="+353766840001@voice.eir.ie">
                  <userPassword>01234567890</userPassword>
               </privateUser>
            </setIMSSubscription>
         </cai3:MOAttributes>
      </cai3:Set>
   </soapenv:Body>
</soapenv:Envelope>
