soap_namespace_and_structure_issue_with_xml_instance/ns2_output_xml_isntance.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns:naas="http://schemas.ericsson.com/ma/CA/NaaS/">
   <soapenv:Header>
      <cai3:SessionId>?</cai3:SessionId>
   </soapenv:Header>
   <soapenv:Body>
      <cai3:Create>
         <cai3:MOType>NaaS@http://schemas.ericsson.com/ma/CA/NaaS/</cai3:MOType>
         <cai3:MOId>
            <naas:MSISDN></naas:MSISDN>
            <!--Optional:-->
            <naas:IMSI></naas:IMSI>
         </cai3:MOId>
         <cai3:MOAttributes>
            <naas:CreateNaaS>
               <!--Optional:-->
               <naas:MSISDN></naas:MSISDN>
               <naas:NBPARAM></naas:NBPARAM>
               <naas:IMSI>?</naas:IMSI>
               <naas:CORRELATIONID></naas:CORRELATIONID>
               <!--Optional:-->
               <naas:REQUESTTYPE></naas:REQUESTTYPE>
               <!--Optional:-->
               <naas:MOBILEACCESSUUID></naas:MOBILEACCESSUUID>
               <!--Optional:-->
               <naas:SERVICEPROVIDERID></naas:SERVICEPROVIDERID>
               <!--Optional:-->
               <naas:ACCESSTYPE></naas:ACCESSTYPE>
               <!--Optional:-->
               <naas:INTERNATIONALROAMING></naas:INTERNATIONALROAMING>
               <!--Optional:-->
               <naas:VMPIN>?</naas:VMPIN>
               <!--Optional:-->
               <naas:CALLING>
                  <!--Optional:-->
                  <naas:CALLINGSERVICEPROFILE></naas:CALLINGSERVICEPROFILE>
                  <!--Optional:-->
                  <naas:RATINGCONTEXT></naas:RATINGCONTEXT>
                  <!--Optional:-->
                  <naas:CALLRESTRICTION></naas:CALLRESTRICTION>
                  <!--Optional:-->
                  <naas:IDDDIVERSIONALLOWED></naas:IDDDIVERSIONALLOWED>
                  <!--Optional:-->
                  <naas:CLIPPRESENTATION></naas:CLIPPRESENTATION>
                  <!--Optional:-->
                  <naas:CALLNUMBERDISPLAY></naas:CALLNUMBERDISPLAY>
                  <!--Optional:-->
                  <naas:MULTIPARTYCONFERENCING></naas:MULTIPARTYCONFERENCING>
                  <!--Optional:-->
                  <naas:VIDEOCALLING></naas:VIDEOCALLING>
                  <!--Optional:-->
                  <naas:DEFAULTCALLBACKNOTIFICATION></naas:DEFAULTCALLBACKNOTIFICATION>
                  <!--Optional:-->
                  <naas:CALLFORWARINGTIMER></naas:CALLFORWARINGTIMER>
               </naas:CALLING>
               <!--Optional:-->
               <naas:VOICEMAIL>
                  <!--Optional:-->
                  <naas:TYPE></naas:TYPE>
                  <!--Optional:-->
                  <naas:SERVICESTATELOCATION></naas:SERVICESTATELOCATION>
               </naas:VOICEMAIL>
               <!--Optional:-->
               <naas:MESSAGING>
                  <!--Optional:-->
                  <naas:RATINGCONTEXT></naas:RATINGCONTEXT>
                  <!--Optional:-->
                  <naas:MMSENABLED></naas:MMSENABLED>
                  <!--Optional:-->
                  <naas:RCS></naas:RCS>
                  <!--Optional:-->
                  <naas:MSGRESTRICTION></naas:MSGRESTRICTION>
               </naas:MESSAGING>
               <!--Optional:-->
               <naas:DATA>
                  <!--Optional:-->
                  <naas:RATINGCONTEXT></naas:RATINGCONTEXT>
                  <!--Optional:-->
                  <naas:DATANAME></naas:DATANAME>
                  <!--Optional:-->
                  <naas:ACCESSPOINT></naas:ACCESSPOINT>
                  <!--Optional:-->
                  <naas:GRADEOFSERVICE></naas:GRADEOFSERVICE>
                  <!--Optional:-->
                  <naas:DATABANDWIDTH></naas:DATABANDWIDTH>
                  <!--Optional:-->
                  <naas:SHAPING></naas:SHAPING>
               </naas:DATA>
            </naas:CreateNaaS>
         </cai3:MOAttributes>
      </cai3:Create>
   </soapenv:Body>
</soapenv:Envelope>