monitoreos/bloquearmovilGT/logs/log_20250729_084600.txt

[2025-07-29 08:46:00.061] Inicio del envío
Endpoint: http://172.20.11.105:8080/CAI3G1.2/services/CAI3G1.2/async
Usuario: EmaCmdSV
Delay: 5000 ms

[2025-07-29 08:46:00.062] [0] XML generado:
<?xml version="1.0" encoding="ISO-8859-1" standalone="yes"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" 
                  xmlns:dth="http://schemas.ericsson.com/ma/CA/DTHBatch/">
  <soapenv:Header>
    <soapenv:Security>
      <soapenv:UsernameToken>
        <soapenv:Username>EmaCmdSV</soapenv:Username>
        <soapenv:Password>EmaCmdSV@1</soapenv:Password>
      </soapenv:UsernameToken>
    </soapenv:Security>
  </soapenv:Header>
  <soapenv:Body>
    <cai3:Delete>
      <cai3:MOType>DTH@http://schemas.ericsson.com/ma/CA/DTHBatch/</cai3:MOType>
      <cai3:MOId>
        <dth:OrderID>2284069215</dth:OrderID>
      </cai3:MOId>
      <cai3:MOAttributes>
        <dth:DeleteDTH OrderID="2284069215">
          <dth:Devices>
            <dth:Device>
              <dth:STU_number>2198426280</dth:STU_number>
              <dth:SC_uniqueAddress>2284069215</dth:SC_uniqueAddress>
            </dth:Device>
          </dth:Devices>
        </dth:DeleteDTH>
      </cai3:MOAttributes>
    </cai3:Delete>
  </soapenv:Body>
</soapenv:Envelope>

[2025-07-29 08:46:00.189] [0] Envío exitoso - Duración: 0.13s

----------------------------------------

[2025-07-29 08:46:05.191] [1] XML generado:
<?xml version="1.0" encoding="ISO-8859-1" standalone="yes"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" 
                  xmlns:dth="http://schemas.ericsson.com/ma/CA/DTHBatch/">
  <soapenv:Header>
    <soapenv:Security>
      <soapenv:UsernameToken>
        <soapenv:Username>EmaCmdSV</soapenv:Username>
        <soapenv:Password>EmaCmdSV@1</soapenv:Password>
      </soapenv:UsernameToken>
    </soapenv:Security>
  </soapenv:Header>
  <soapenv:Body>
    <cai3:Delete>
      <cai3:MOType>DTH@http://schemas.ericsson.com/ma/CA/DTHBatch/</cai3:MOType>
      <cai3:MOId>
        <dth:OrderID>1428690149</dth:OrderID>
      </cai3:MOId>
      <cai3:MOAttributes>
        <dth:DeleteDTH OrderID="1428690149">
          <dth:Devices>
            <dth:Device>
              <dth:STU_number>2309311830</dth:STU_number>
              <dth:SC_uniqueAddress>1428690149</dth:SC_uniqueAddress>
            </dth:Device>
          </dth:Devices>
        </dth:DeleteDTH>
      </cai3:MOAttributes>
    </cai3:Delete>
  </soapenv:Body>
</soapenv:Envelope>

[2025-07-29 08:46:05.234] [1] Envío exitoso - Duración: 0.04s

----------------------------------------

[2025-07-29 08:46:10.235] [2] XML generado:
<?xml version="1.0" encoding="ISO-8859-1" standalone="yes"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" 
                  xmlns:dth="http://schemas.ericsson.com/ma/CA/DTHBatch/">
  <soapenv:Header>
    <soapenv:Security>
      <soapenv:UsernameToken>
        <soapenv:Username>EmaCmdSV</soapenv:Username>
        <soapenv:Password>EmaCmdSV@1</soapenv:Password>
      </soapenv:UsernameToken>
    </soapenv:Security>
  </soapenv:Header>
  <soapenv:Body>
    <cai3:Delete>
      <cai3:MOType>DTH@http://schemas.ericsson.com/ma/CA/DTHBatch/</cai3:MOType>
      <cai3:MOId>
        <dth:OrderID>1301223323</dth:OrderID>
      </cai3:MOId>
      <cai3:MOAttributes>
        <dth:DeleteDTH OrderID="1301223323">
          <dth:Devices>
            <dth:Device>
              <dth:STU_number>2198668278</dth:STU_number>
              <dth:SC_uniqueAddress>1301223323</dth:SC_uniqueAddress>
            </dth:Device>
          </dth:Devices>
        </dth:DeleteDTH>
      </cai3:MOAttributes>
    </cai3:Delete>
  </soapenv:Body>
</soapenv:Envelope>

[2025-07-29 08:46:10.298] [2] Envío exitoso - Duración: 0.06s

----------------------------------------

[2025-07-29 08:46:15.298] [3] XML generado:
<?xml version="1.0" encoding="ISO-8859-1" standalone="yes"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" 
                  xmlns:dth="http://schemas.ericsson.com/ma/CA/DTHBatch/">
  <soapenv:Header>
    <soapenv:Security>
      <soapenv:UsernameToken>
        <soapenv:Username>EmaCmdSV</soapenv:Username>
        <soapenv:Password>EmaCmdSV@1</soapenv:Password>
      </soapenv:UsernameToken>
    </soapenv:Security>
  </soapenv:Header>
  <soapenv:Body>
    <cai3:Delete>
      <cai3:MOType>DTH@http://schemas.ericsson.com/ma/CA/DTHBatch/</cai3:MOType>
      <cai3:MOId>
        <dth:OrderID>1301764163</dth:OrderID>
      </cai3:MOId>
      <cai3:MOAttributes>
        <dth:DeleteDTH OrderID="1301764163">
          <dth:Devices>
            <dth:Device>
              <dth:STU_number>2197361724</dth:STU_number>
              <dth:SC_uniqueAddress>1301764163</dth:SC_uniqueAddress>
            </dth:Device>
          </dth:Devices>
        </dth:DeleteDTH>
      </cai3:MOAttributes>
    </cai3:Delete>
  </soapenv:Body>
</soapenv:Envelope>

[2025-07-29 08:46:15.352] [3] Envío exitoso - Duración: 0.05s

----------------------------------------

[2025-07-29 08:46:20.361] Proceso detenido manualmente
